Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/include/proc/p32mz1025dak176.h
extern volatile __CNENDbits_t CNENDbits __asm__ ("CNEND") __attribute__((section("sfrs"), address(0xBF860380)));
extern volatile uint32_t        CNENDCLR __attribute__((section("sfrs"),address(0xBF860384)));
extern volatile uint32_t        CNENDSET __attribute__((section("sfrs"),address(0xBF860388)));
extern volatile uint32_t        CNENDINV __attribute__((section("sfrs"),address(0xBF86038C)));
#define CNSTATD CNSTATD
extern volatile uint32_t   CNSTATD __attribute__((section("sfrs"), address(0xBF860390)));
typedef union {
  struct {
    uint32_t CNSTATD0:1;
    uint32_t CNSTATD1:1;
    uint32_t CNSTATD2:1;
    uint32_t CNSTATD3:1;
    uint32_t CNSTATD4:1;
    uint32_t CNSTATD5:1;
    uint32_t CNSTATD6:1;
    uint32_t CNSTATD7:1;
    uint32_t :1;
    uint32_t CNSTATD9:1;
    uint32_t CNSTATD10:1;
    uint32_t CNSTATD11:1;
    uint32_t CNSTATD12:1;
    uint32_t CNSTATD13:1;
    uint32_t CNSTATD14:1;
    uint32_t CNSTATD15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATDbits_t;
extern volatile __CNSTATDbits_t CNSTATDbits __asm__ ("CNSTATD") __attribute__((section("sfrs"), address(0xBF860390)));
extern volatile uint32_t        CNSTATDCLR __attribute__((section("sfrs"),address(0xBF860394)));
extern volatile uint32_t        CNSTATDSET __attribute__((section("sfrs"),address(0xBF860398)));
extern volatile uint32_t        CNSTATDINV __attribute__((section("sfrs"),address(0xBF86039C)));
#define CNNED CNNED
extern volatile uint32_t   CNNED __attribute__((section("sfrs"), address(0xBF8603A0)));
typedef struct {
  uint32_t CNNED0:1;
  uint32_t CNNED1:1;
  uint32_t CNNED2:1;
  uint32_t CNNED3:1;
  uint32_t CNNED4:1;
  uint32_t CNNED5:1;
  uint32_t CNNED6:1;
  uint32_t CNNED7:1;
  uint32_t :1;
  uint32_t CNNED9:1;
  uint32_t CNNED10:1;
  uint32_t CNNED11:1;
  uint32_t CNNED12:1;
  uint32_t CNNED13:1;
  uint32_t CNNED14:1;
  uint32_t CNNED15:1;
} __CNNEDbits_t;
extern volatile __CNNEDbits_t CNNEDbits __asm__ ("CNNED") __attribute__((section("sfrs"), address(0xBF8603A0)));
extern volatile uint32_t        CNNEDCLR __attribute__((section("sfrs"),address(0xBF8603A4)));
extern volatile uint32_t        CNNEDSET __attribute__((section("sfrs"),address(0xBF8603A8)));
extern volatile uint32_t        CNNEDINV __attribute__((section("sfrs"),address(0xBF8603AC)));
#define CNFD CNFD
extern volatile uint32_t   CNFD __attribute__((section("sfrs"), address(0xBF8603B0)));
typedef struct {
  uint32_t CNFD0:1;
  uint32_t CNFD1:1;
  uint32_t CNFD2:1;
  uint32_t CNFD3:1;
  uint32_t CNFD4:1;
  uint32_t CNFD5:1;
  uint32_t CNFD6:1;
  uint32_t CNFD7:1;
  uint32_t :1;
  uint32_t CNFD9:1;
  uint32_t CNFD10:1;
  uint32_t CNFD11:1;
  uint32_t CNFD12:1;
  uint32_t CNFD13:1;
  uint32_t CNFD14:1;
  uint32_t CNFD15:1;
} __CNFDbits_t;
extern volatile __CNFDbits_t CNFDbits __asm__ ("CNFD") __attribute__((section("sfrs"), address(0xBF8603B0)));
extern volatile uint32_t        CNFDCLR __attribute__((section("sfrs"),address(0xBF8603B4)));
extern volatile uint32_t        CNFDSET __attribute__((section("sfrs"),address(0xBF8603B8)));
extern volatile uint32_t        CNFDINV __attribute__((section("sfrs"),address(0xBF8603BC)));
#define SRCON0D SRCON0D
extern volatile uint32_t   SRCON0D __attribute__((section("sfrs"), address(0xBF8603C0)));
typedef struct {
  uint32_t SR0D0:1;
  uint32_t SR0D1:1;
  uint32_t SR0D2:1;
  uint32_t SR0D3:1;
  uint32_t SR0D4:1;
  uint32_t SR0D5:1;
  uint32_t SR0D6:1;
  uint32_t SR0D7:1;
  uint32_t :1;
  uint32_t SR0D9:1;
  uint32_t SR0D10:1;
  uint32_t SR0D11:1;
  uint32_t SR0D12:1;
  uint32_t SR0D13:1;
  uint32_t SR0D14:1;
  uint32_t SR0D15:1;
} __SRCON0Dbits_t;
extern volatile __SRCON0Dbits_t SRCON0Dbits __asm__ ("SRCON0D") __attribute__((section("sfrs"), address(0xBF8603C0)));
extern volatile uint32_t        SRCON0DCLR __attribute__((section("sfrs"),address(0xBF8603C4)));
extern volatile uint32_t        SRCON0DSET __attribute__((section("sfrs"),address(0xBF8603C8)));
extern volatile uint32_t        SRCON0DINV __attribute__((section("sfrs"),address(0xBF8603CC)));
#define SRCON1D SRCON1D
extern volatile uint32_t   SRCON1D __attribute__((section("sfrs"), address(0xBF8603D0)));
typedef struct {
  uint32_t SR1D0:1;
  uint32_t SR1D1:1;
  uint32_t SR1D2:1;
  uint32_t SR1D3:1;
  uint32_t SR1D4:1;
  uint32_t SR1D5:1;
  uint32_t SR1D6:1;
  uint32_t SR1D7:1;
  uint32_t :1;
  uint32_t SR1D9:1;
  uint32_t SR1D10:1;
  uint32_t SR1D11:1;
  uint32_t SR1D12:1;
  uint32_t SR1D13:1;
  uint32_t SR1D14:1;
  uint32_t SR1D15:1;
} __SRCON1Dbits_t;
extern volatile __SRCON1Dbits_t SRCON1Dbits __asm__ ("SRCON1D") __attribute__((section("sfrs"), address(0xBF8603D0)));
extern volatile uint32_t        SRCON1DCLR __attribute__((section("sfrs"),address(0xBF8603D4)));
extern volatile uint32_t        SRCON1DSET __attribute__((section("sfrs"),address(0xBF8603D8)));
extern volatile uint32_t        SRCON1DINV __attribute__((section("sfrs"),address(0xBF8603DC)));
#define ANSELE ANSELE
extern volatile uint32_t   ANSELE __attribute__((section("sfrs"), address(0xBF860400)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t ANSE1:1;
    uint32_t :2;
    uint32_t ANSE4:1;
    uint32_t :1;
    uint32_t ANSE6:1;
    uint32_t ANSE7:1;
    uint32_t ANSE8:1;
    uint32_t ANSE9:1;
  };
  struct {
    uint32_t w:32;
  };
} __ANSELEbits_t;
extern volatile __ANSELEbits_t ANSELEbits __asm__ ("ANSELE") __attribute__((section("sfrs"), address(0xBF860400)));
extern volatile uint32_t        ANSELECLR __attribute__((section("sfrs"),address(0xBF860404)));
extern volatile uint32_t        ANSELESET __attribute__((section("sfrs"),address(0xBF860408)));
extern volatile uint32_t        ANSELEINV __attribute__((section("sfrs"),address(0xBF86040C)));
#define TRISE TRISE
extern volatile uint32_t   TRISE __attribute__((section("sfrs"), address(0xBF860410)));
typedef union {
  struct {
    uint32_t TRISE0:1;
    uint32_t TRISE1:1;
    uint32_t TRISE2:1;
    uint32_t TRISE3:1;
    uint32_t TRISE4:1;
    uint32_t TRISE5:1;
    uint32_t TRISE6:1;
    uint32_t TRISE7:1;
    uint32_t TRISE8:1;
    uint32_t TRISE9:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISEbits_t;
