Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/include/proc/p32mz1025dak176.h
extern volatile __SBT3REG1bits_t SBT3REG1bits __asm__ ("SBT3REG1") __attribute__((section("sfrs"), address(0xBF8F8C60)));
#define SBT3RD1 SBT3RD1
extern volatile uint32_t   SBT3RD1 __attribute__((section("sfrs"), address(0xBF8F8C70)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT3RD1bits_t;
extern volatile __SBT3RD1bits_t SBT3RD1bits __asm__ ("SBT3RD1") __attribute__((section("sfrs"), address(0xBF8F8C70)));
#define SBT3WR1 SBT3WR1
extern volatile uint32_t   SBT3WR1 __attribute__((section("sfrs"), address(0xBF8F8C78)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT3WR1bits_t;
extern volatile __SBT3WR1bits_t SBT3WR1bits __asm__ ("SBT3WR1") __attribute__((section("sfrs"), address(0xBF8F8C78)));
#define SBT3REG2 SBT3REG2
extern volatile uint32_t   SBT3REG2 __attribute__((section("sfrs"), address(0xBF8F8C80)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT3REG2bits_t;
extern volatile __SBT3REG2bits_t SBT3REG2bits __asm__ ("SBT3REG2") __attribute__((section("sfrs"), address(0xBF8F8C80)));
#define SBT3RD2 SBT3RD2
extern volatile uint32_t   SBT3RD2 __attribute__((section("sfrs"), address(0xBF8F8C90)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT3RD2bits_t;
extern volatile __SBT3RD2bits_t SBT3RD2bits __asm__ ("SBT3RD2") __attribute__((section("sfrs"), address(0xBF8F8C90)));
#define SBT3WR2 SBT3WR2
extern volatile uint32_t   SBT3WR2 __attribute__((section("sfrs"), address(0xBF8F8C98)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT3WR2bits_t;
extern volatile __SBT3WR2bits_t SBT3WR2bits __asm__ ("SBT3WR2") __attribute__((section("sfrs"), address(0xBF8F8C98)));
#define SBT4ELOG1 SBT4ELOG1
extern volatile uint32_t   SBT4ELOG1 __attribute__((section("sfrs"), address(0xBF8F9020)));
typedef struct {
  uint32_t CMD:3;
  uint32_t :1;
  uint32_t REGION:4;
  uint32_t INITID:8;
  uint32_t :8;
  uint32_t CODE:4;
  uint32_t :3;
  uint32_t MULTI:1;
} __SBT4ELOG1bits_t;
extern volatile __SBT4ELOG1bits_t SBT4ELOG1bits __asm__ ("SBT4ELOG1") __attribute__((section("sfrs"), address(0xBF8F9020)));
#define SBT4ELOG2 SBT4ELOG2
extern volatile uint32_t   SBT4ELOG2 __attribute__((section("sfrs"), address(0xBF8F9024)));
typedef struct {
  uint32_t GROUP:2;
} __SBT4ELOG2bits_t;
extern volatile __SBT4ELOG2bits_t SBT4ELOG2bits __asm__ ("SBT4ELOG2") __attribute__((section("sfrs"), address(0xBF8F9024)));
#define SBT4ECON SBT4ECON
extern volatile uint32_t   SBT4ECON __attribute__((section("sfrs"), address(0xBF8F9028)));
typedef struct {
  uint32_t :24;
  uint32_t ERRP:1;
} __SBT4ECONbits_t;
extern volatile __SBT4ECONbits_t SBT4ECONbits __asm__ ("SBT4ECON") __attribute__((section("sfrs"), address(0xBF8F9028)));
#define SBT4ECLRS SBT4ECLRS
extern volatile uint32_t   SBT4ECLRS __attribute__((section("sfrs"), address(0xBF8F9030)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT4ECLRSbits_t;
extern volatile __SBT4ECLRSbits_t SBT4ECLRSbits __asm__ ("SBT4ECLRS") __attribute__((section("sfrs"), address(0xBF8F9030)));
#define SBT4ECLRM SBT4ECLRM
extern volatile uint32_t   SBT4ECLRM __attribute__((section("sfrs"), address(0xBF8F9038)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT4ECLRMbits_t;
extern volatile __SBT4ECLRMbits_t SBT4ECLRMbits __asm__ ("SBT4ECLRM") __attribute__((section("sfrs"), address(0xBF8F9038)));
#define SBT4REG0 SBT4REG0
extern volatile uint32_t   SBT4REG0 __attribute__((section("sfrs"), address(0xBF8F9040)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT4REG0bits_t;
extern volatile __SBT4REG0bits_t SBT4REG0bits __asm__ ("SBT4REG0") __attribute__((section("sfrs"), address(0xBF8F9040)));
#define SBT4RD0 SBT4RD0
extern volatile uint32_t   SBT4RD0 __attribute__((section("sfrs"), address(0xBF8F9050)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT4RD0bits_t;
extern volatile __SBT4RD0bits_t SBT4RD0bits __asm__ ("SBT4RD0") __attribute__((section("sfrs"), address(0xBF8F9050)));
#define SBT4WR0 SBT4WR0
extern volatile uint32_t   SBT4WR0 __attribute__((section("sfrs"), address(0xBF8F9058)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT4WR0bits_t;
extern volatile __SBT4WR0bits_t SBT4WR0bits __asm__ ("SBT4WR0") __attribute__((section("sfrs"), address(0xBF8F9058)));
#define SBT4REG1 SBT4REG1
extern volatile uint32_t   SBT4REG1 __attribute__((section("sfrs"), address(0xBF8F9060)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT4REG1bits_t;
extern volatile __SBT4REG1bits_t SBT4REG1bits __asm__ ("SBT4REG1") __attribute__((section("sfrs"), address(0xBF8F9060)));
#define SBT4RD1 SBT4RD1
extern volatile uint32_t   SBT4RD1 __attribute__((section("sfrs"), address(0xBF8F9070)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT4RD1bits_t;
extern volatile __SBT4RD1bits_t SBT4RD1bits __asm__ ("SBT4RD1") __attribute__((section("sfrs"), address(0xBF8F9070)));
#define SBT4WR1 SBT4WR1
extern volatile uint32_t   SBT4WR1 __attribute__((section("sfrs"), address(0xBF8F9078)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT4WR1bits_t;
extern volatile __SBT4WR1bits_t SBT4WR1bits __asm__ ("SBT4WR1") __attribute__((section("sfrs"), address(0xBF8F9078)));
#define SBT4REG2 SBT4REG2
extern volatile uint32_t   SBT4REG2 __attribute__((section("sfrs"), address(0xBF8F9080)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT4REG2bits_t;
extern volatile __SBT4REG2bits_t SBT4REG2bits __asm__ ("SBT4REG2") __attribute__((section("sfrs"), address(0xBF8F9080)));
#define SBT4RD2 SBT4RD2
extern volatile uint32_t   SBT4RD2 __attribute__((section("sfrs"), address(0xBF8F9090)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT4RD2bits_t;
extern volatile __SBT4RD2bits_t SBT4RD2bits __asm__ ("SBT4RD2") __attribute__((section("sfrs"), address(0xBF8F9090)));
#define SBT4WR2 SBT4WR2
extern volatile uint32_t   SBT4WR2 __attribute__((section("sfrs"), address(0xBF8F9098)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT4WR2bits_t;
extern volatile __SBT4WR2bits_t SBT4WR2bits __asm__ ("SBT4WR2") __attribute__((section("sfrs"), address(0xBF8F9098)));
#define SBT4REG3 SBT4REG3
extern volatile uint32_t   SBT4REG3 __attribute__((section("sfrs"), address(0xBF8F90A0)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT4REG3bits_t;
extern volatile __SBT4REG3bits_t SBT4REG3bits __asm__ ("SBT4REG3") __attribute__((section("sfrs"), address(0xBF8F90A0)));
#define SBT4RD3 SBT4RD3
extern volatile uint32_t   SBT4RD3 __attribute__((section("sfrs"), address(0xBF8F90B0)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT4RD3bits_t;
extern volatile __SBT4RD3bits_t SBT4RD3bits __asm__ ("SBT4RD3") __attribute__((section("sfrs"), address(0xBF8F90B0)));
#define SBT4WR3 SBT4WR3
extern volatile uint32_t   SBT4WR3 __attribute__((section("sfrs"), address(0xBF8F90B8)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT4WR3bits_t;
