Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/include/proc/p32mz1025dak176.h
#define _GLCDSTAT_HSYNC_POSITION                 0x00000002
#define _GLCDSTAT_HSYNC_MASK                     0x00000004
#define _GLCDSTAT_HSYNC_LENGTH                   0x00000001

#define _GLCDSTAT_VSYNC_POSITION                 0x00000003
#define _GLCDSTAT_VSYNC_MASK                     0x00000008
#define _GLCDSTAT_VSYNC_LENGTH                   0x00000001

#define _GLCDSTAT_LROW_POSITION                  0x00000005
#define _GLCDSTAT_LROW_MASK                      0x00000020
#define _GLCDSTAT_LROW_LENGTH                    0x00000001

#define _GLCDCLUT0_BLUE_POSITION                 0x00000000
#define _GLCDCLUT0_BLUE_MASK                     0x000000FF
#define _GLCDCLUT0_BLUE_LENGTH                   0x00000008

#define _GLCDCLUT0_GREEN_POSITION                0x00000008
#define _GLCDCLUT0_GREEN_MASK                    0x0000FF00
#define _GLCDCLUT0_GREEN_LENGTH                  0x00000008

#define _GLCDCLUT0_RED_POSITION                  0x00000010
#define _GLCDCLUT0_RED_MASK                      0x00FF0000
#define _GLCDCLUT0_RED_LENGTH                    0x00000008

#define _GLCDCLUT1_BLUE_POSITION                 0x00000000
#define _GLCDCLUT1_BLUE_MASK                     0x000000FF
#define _GLCDCLUT1_BLUE_LENGTH                   0x00000008

#define _GLCDCLUT1_GREEN_POSITION                0x00000008
#define _GLCDCLUT1_GREEN_MASK                    0x0000FF00
#define _GLCDCLUT1_GREEN_LENGTH                  0x00000008

#define _GLCDCLUT1_RED_POSITION                  0x00000010
#define _GLCDCLUT1_RED_MASK                      0x00FF0000
#define _GLCDCLUT1_RED_LENGTH                    0x00000008

#define _GLCDCLUT2_BLUE_POSITION                 0x00000000
#define _GLCDCLUT2_BLUE_MASK                     0x000000FF
#define _GLCDCLUT2_BLUE_LENGTH                   0x00000008

#define _GLCDCLUT2_GREEN_POSITION                0x00000008
#define _GLCDCLUT2_GREEN_MASK                    0x0000FF00
#define _GLCDCLUT2_GREEN_LENGTH                  0x00000008

#define _GLCDCLUT2_RED_POSITION                  0x00000010
#define _GLCDCLUT2_RED_MASK                      0x00FF0000
#define _GLCDCLUT2_RED_LENGTH                    0x00000008

#define _GLCDCLUT3_BLUE_POSITION                 0x00000000
#define _GLCDCLUT3_BLUE_MASK                     0x000000FF
#define _GLCDCLUT3_BLUE_LENGTH                   0x00000008

#define _GLCDCLUT3_GREEN_POSITION                0x00000008
#define _GLCDCLUT3_GREEN_MASK                    0x0000FF00
#define _GLCDCLUT3_GREEN_LENGTH                  0x00000008

#define _GLCDCLUT3_RED_POSITION                  0x00000010
#define _GLCDCLUT3_RED_MASK                      0x00FF0000
#define _GLCDCLUT3_RED_LENGTH                    0x00000008

#define _GLCDCLUT4_BLUE_POSITION                 0x00000000
#define _GLCDCLUT4_BLUE_MASK                     0x000000FF
#define _GLCDCLUT4_BLUE_LENGTH                   0x00000008

#define _GLCDCLUT4_GREEN_POSITION                0x00000008
#define _GLCDCLUT4_GREEN_MASK                    0x0000FF00
#define _GLCDCLUT4_GREEN_LENGTH                  0x00000008

#define _GLCDCLUT4_RED_POSITION                  0x00000010
#define _GLCDCLUT4_RED_MASK                      0x00FF0000
#define _GLCDCLUT4_RED_LENGTH                    0x00000008

#define _GLCDCLUT5_BLUE_POSITION                 0x00000000
#define _GLCDCLUT5_BLUE_MASK                     0x000000FF
#define _GLCDCLUT5_BLUE_LENGTH                   0x00000008

#define _GLCDCLUT5_GREEN_POSITION                0x00000008
#define _GLCDCLUT5_GREEN_MASK                    0x0000FF00
#define _GLCDCLUT5_GREEN_LENGTH                  0x00000008

#define _GLCDCLUT5_RED_POSITION                  0x00000010
#define _GLCDCLUT5_RED_MASK                      0x00FF0000
#define _GLCDCLUT5_RED_LENGTH                    0x00000008

#define _GLCDCLUT6_BLUE_POSITION                 0x00000000
#define _GLCDCLUT6_BLUE_MASK                     0x000000FF
#define _GLCDCLUT6_BLUE_LENGTH                   0x00000008

#define _GLCDCLUT6_GREEN_POSITION                0x00000008
#define _GLCDCLUT6_GREEN_MASK                    0x0000FF00
#define _GLCDCLUT6_GREEN_LENGTH                  0x00000008

#define _GLCDCLUT6_RED_POSITION                  0x00000010
#define _GLCDCLUT6_RED_MASK                      0x00FF0000
#define _GLCDCLUT6_RED_LENGTH                    0x00000008

#define _GLCDCLUT7_BLUE_POSITION                 0x00000000
#define _GLCDCLUT7_BLUE_MASK                     0x000000FF
#define _GLCDCLUT7_BLUE_LENGTH                   0x00000008

#define _GLCDCLUT7_GREEN_POSITION                0x00000008
#define _GLCDCLUT7_GREEN_MASK                    0x0000FF00
#define _GLCDCLUT7_GREEN_LENGTH                  0x00000008

#define _GLCDCLUT7_RED_POSITION                  0x00000010
#define _GLCDCLUT7_RED_MASK                      0x00FF0000
#define _GLCDCLUT7_RED_LENGTH                    0x00000008

#define _GLCDCLUT8_BLUE_POSITION                 0x00000000
#define _GLCDCLUT8_BLUE_MASK                     0x000000FF
#define _GLCDCLUT8_BLUE_LENGTH                   0x00000008

#define _GLCDCLUT8_GREEN_POSITION                0x00000008
#define _GLCDCLUT8_GREEN_MASK                    0x0000FF00
#define _GLCDCLUT8_GREEN_LENGTH                  0x00000008

#define _GLCDCLUT8_RED_POSITION                  0x00000010
#define _GLCDCLUT8_RED_MASK                      0x00FF0000
#define _GLCDCLUT8_RED_LENGTH                    0x00000008

#define _GLCDCLUT9_BLUE_POSITION                 0x00000000
#define _GLCDCLUT9_BLUE_MASK                     0x000000FF
#define _GLCDCLUT9_BLUE_LENGTH                   0x00000008

#define _GLCDCLUT9_GREEN_POSITION                0x00000008
#define _GLCDCLUT9_GREEN_MASK                    0x0000FF00
#define _GLCDCLUT9_GREEN_LENGTH                  0x00000008

#define _GLCDCLUT9_RED_POSITION                  0x00000010
#define _GLCDCLUT9_RED_MASK                      0x00FF0000
#define _GLCDCLUT9_RED_LENGTH                    0x00000008

#define _GLCDCLUT10_BLUE_POSITION                0x00000000
#define _GLCDCLUT10_BLUE_MASK                    0x000000FF
#define _GLCDCLUT10_BLUE_LENGTH                  0x00000008

