Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/include/proc/p32mz1025dak176.h
#define _GLCDCLUT22_BLUE_POSITION                0x00000000
#define _GLCDCLUT22_BLUE_MASK                    0x000000FF
#define _GLCDCLUT22_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT22_GREEN_POSITION               0x00000008
#define _GLCDCLUT22_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT22_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT22_RED_POSITION                 0x00000010
#define _GLCDCLUT22_RED_MASK                     0x00FF0000
#define _GLCDCLUT22_RED_LENGTH                   0x00000008

#define _GLCDCLUT23_BLUE_POSITION                0x00000000
#define _GLCDCLUT23_BLUE_MASK                    0x000000FF
#define _GLCDCLUT23_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT23_GREEN_POSITION               0x00000008
#define _GLCDCLUT23_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT23_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT23_RED_POSITION                 0x00000010
#define _GLCDCLUT23_RED_MASK                     0x00FF0000
#define _GLCDCLUT23_RED_LENGTH                   0x00000008

#define _GLCDCLUT24_BLUE_POSITION                0x00000000
#define _GLCDCLUT24_BLUE_MASK                    0x000000FF
#define _GLCDCLUT24_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT24_GREEN_POSITION               0x00000008
#define _GLCDCLUT24_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT24_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT24_RED_POSITION                 0x00000010
#define _GLCDCLUT24_RED_MASK                     0x00FF0000
#define _GLCDCLUT24_RED_LENGTH                   0x00000008

#define _GLCDCLUT25_BLUE_POSITION                0x00000000
#define _GLCDCLUT25_BLUE_MASK                    0x000000FF
#define _GLCDCLUT25_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT25_GREEN_POSITION               0x00000008
#define _GLCDCLUT25_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT25_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT25_RED_POSITION                 0x00000010
#define _GLCDCLUT25_RED_MASK                     0x00FF0000
#define _GLCDCLUT25_RED_LENGTH                   0x00000008

#define _GLCDCLUT26_BLUE_POSITION                0x00000000
#define _GLCDCLUT26_BLUE_MASK                    0x000000FF
#define _GLCDCLUT26_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT26_GREEN_POSITION               0x00000008
#define _GLCDCLUT26_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT26_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT26_RED_POSITION                 0x00000010
#define _GLCDCLUT26_RED_MASK                     0x00FF0000
#define _GLCDCLUT26_RED_LENGTH                   0x00000008

#define _GLCDCLUT27_BLUE_POSITION                0x00000000
#define _GLCDCLUT27_BLUE_MASK                    0x000000FF
#define _GLCDCLUT27_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT27_GREEN_POSITION               0x00000008
#define _GLCDCLUT27_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT27_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT27_RED_POSITION                 0x00000010
#define _GLCDCLUT27_RED_MASK                     0x00FF0000
#define _GLCDCLUT27_RED_LENGTH                   0x00000008

#define _GLCDCLUT28_BLUE_POSITION                0x00000000
#define _GLCDCLUT28_BLUE_MASK                    0x000000FF
#define _GLCDCLUT28_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT28_GREEN_POSITION               0x00000008
#define _GLCDCLUT28_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT28_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT28_RED_POSITION                 0x00000010
#define _GLCDCLUT28_RED_MASK                     0x00FF0000
#define _GLCDCLUT28_RED_LENGTH                   0x00000008

#define _GLCDCLUT29_BLUE_POSITION                0x00000000
#define _GLCDCLUT29_BLUE_MASK                    0x000000FF
#define _GLCDCLUT29_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT29_GREEN_POSITION               0x00000008
#define _GLCDCLUT29_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT29_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT29_RED_POSITION                 0x00000010
#define _GLCDCLUT29_RED_MASK                     0x00FF0000
#define _GLCDCLUT29_RED_LENGTH                   0x00000008

#define _GLCDCLUT30_BLUE_POSITION                0x00000000
#define _GLCDCLUT30_BLUE_MASK                    0x000000FF
#define _GLCDCLUT30_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT30_GREEN_POSITION               0x00000008
#define _GLCDCLUT30_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT30_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT30_RED_POSITION                 0x00000010
#define _GLCDCLUT30_RED_MASK                     0x00FF0000
#define _GLCDCLUT30_RED_LENGTH                   0x00000008

#define _GLCDCLUT31_BLUE_POSITION                0x00000000
#define _GLCDCLUT31_BLUE_MASK                    0x000000FF
#define _GLCDCLUT31_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT31_GREEN_POSITION               0x00000008
#define _GLCDCLUT31_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT31_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT31_RED_POSITION                 0x00000010
#define _GLCDCLUT31_RED_MASK                     0x00FF0000
#define _GLCDCLUT31_RED_LENGTH                   0x00000008

#define _GLCDCLUT32_BLUE_POSITION                0x00000000
#define _GLCDCLUT32_BLUE_MASK                    0x000000FF
#define _GLCDCLUT32_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT32_GREEN_POSITION               0x00000008
#define _GLCDCLUT32_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT32_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT32_RED_POSITION                 0x00000010
#define _GLCDCLUT32_RED_MASK                     0x00FF0000
#define _GLCDCLUT32_RED_LENGTH                   0x00000008

#define _GLCDCLUT33_BLUE_POSITION                0x00000000
#define _GLCDCLUT33_BLUE_MASK                    0x000000FF
#define _GLCDCLUT33_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT33_GREEN_POSITION               0x00000008
#define _GLCDCLUT33_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT33_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT33_RED_POSITION                 0x00000010
#define _GLCDCLUT33_RED_MASK                     0x00FF0000
#define _GLCDCLUT33_RED_LENGTH                   0x00000008

#define _GLCDCLUT34_BLUE_POSITION                0x00000000
#define _GLCDCLUT34_BLUE_MASK                    0x000000FF
#define _GLCDCLUT34_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT34_GREEN_POSITION               0x00000008
#define _GLCDCLUT34_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT34_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT34_RED_POSITION                 0x00000010
#define _GLCDCLUT34_RED_MASK                     0x00FF0000
#define _GLCDCLUT34_RED_LENGTH                   0x00000008

#define _GLCDCLUT35_BLUE_POSITION                0x00000000
#define _GLCDCLUT35_BLUE_MASK                    0x000000FF
#define _GLCDCLUT35_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT35_GREEN_POSITION               0x00000008
#define _GLCDCLUT35_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT35_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT35_RED_POSITION                 0x00000010
#define _GLCDCLUT35_RED_MASK                     0x00FF0000
#define _GLCDCLUT35_RED_LENGTH                   0x00000008

